stko/oobd/trunk/interface/D2/Firmware_FreeRTOS/Demo/CORTEX_STM32F103E_Eclipse_GCC/src/SystemConfig.c
for (nCount = 0; nCount < 100000; nCount++) {
	};			/* delay */
	BufCnt = 0;
	BTM222_UART_Rx_Flag = pdFALSE;
	USART_SendData(USART1, 'a');
	for (nCount = 0; nCount < nLength; nCount++) {
	};			/* delay */
	USART_SendData(USART1, 't');
	for (nCount = 0; nCount < nLength; nCount++) {
	};			/* delay */
	USART_SendData(USART1, 'l');
	for (nCount = 0; nCount < nLength; nCount++) {
	};			/* delay */
	USART_SendData(USART1, '?');
	for (nCount = 0; nCount < nLength; nCount++) {
	};			/* delay */
	USART_SendData(USART1, '\r');
	for (nCount = 0; nCount < nLength; nCount++) {
	};			/* delay */
	for (nCount = 0; nCount < 800000; nCount++) {
	};			/* delay */
	
	    /* check received response character from BTM222 */ 
	    switch (BTM222_UartSpeed)
	     {
	case '0':
	    DEBUGUARTPRINT("\r\n*** BTM222 - L1 = 4800bps detected! ***");
	    USART_SendData(USART1, 'a');
	    for (nCount = 0; nCount < nLength; nCount++) {
	    };			/* delay */
	    USART_SendData(USART1, 't');
	    for (nCount = 0; nCount < nLength; nCount++) {
	    };			/* delay */
	    USART_SendData(USART1, 'l');
	    for (nCount = 0; nCount < nLength; nCount++) {
	    };			/* delay */
	    USART_SendData(USART1, '5');
	    for (nCount = 0; nCount < nLength; nCount++) {
	    };			/* delay */
	    USART_SendData(USART1, '\r');
	    for (nCount = 0; nCount < nLength; nCount++) {
	    };			/* delay */
	    BTM222_UartAutobaudControl = 6;
	    break;
	case '1':
	    DEBUGUARTPRINT("\r\n*** BTM222 - L1 = 9600bps detected! ***");
	    USART_SendData(USART1, 'a');
	    for (nCount = 0; nCount < nLength; nCount++) {
	    };			/* delay */
	    USART_SendData(USART1, 't');
	    for (nCount = 0; nCount < nLength; nCount++) {
	    };			/* delay */
	    USART_SendData(USART1, 'l');
	    for (nCount = 0; nCount < nLength; nCount++) {
	    };			/* delay */
	    USART_SendData(USART1, '5');
	    for (nCount = 0; nCount < nLength; nCount++) {
	    };			/* delay */
	    USART_SendData(USART1, '\r');
	    for (nCount = 0; nCount < nLength; nCount++) {
	    };			/* delay */
	    BTM222_UartAutobaudControl = 6;
	    break;
	case '2':
	    DEBUGUARTPRINT
		("\r\n*** BTM222 - L2 = 19200bps detected! ***");
	    USART_SendData(USART1, 'a');
	    for (nCount = 0; nCount < nLength; nCount++) {
	    };			/* delay */
	    USART_SendData(USART1, 't');
	    for (nCount = 0; nCount < nLength; nCount++) {
	    };			/* delay */
	    USART_SendData(USART1, 'l');
	    for (nCount = 0; nCount < nLength; nCount++) {
	    };			/* delay */
	    USART_SendData(USART1, '5');
	    for (nCount = 0; nCount < nLength; nCount++) {
	    };			/* delay */
	    USART_SendData(USART1, '\r');
	    for (nCount = 0; nCount < nLength; nCount++) {
	    };			/* delay */
	    BTM222_UartAutobaudControl = 6;
	    break;
	case '3':
	    DEBUGUARTPRINT
		("\r\n*** BTM222 - L3 = 38400bps detected! ***");
	    BTM222_UART_Rx_Flag = pdFALSE;
	    USART_SendData(USART1, 'a');
	    for (nCount = 0; nCount < nLength; nCount++) {
	    };			/* delay */
	    USART_SendData(USART1, 't');
	    for (nCount = 0; nCount < nLength; nCount++) {
	    };			/* delay */
	    USART_SendData(USART1, 'l');
	    for (nCount = 0; nCount < nLength; nCount++) {
	    };			/* delay */
	    USART_SendData(USART1, '5');
	    for (nCount = 0; nCount < nLength; nCount++) {
	    };			/* delay */
	    USART_SendData(USART1, '\r');
	    for (nCount = 0; nCount < nLength; nCount++) {
	    };			/* delay */
	    BTM222_UartAutobaudControl = 6;
	    BTM222_UART_Rx_Flag = pdTRUE;
	    break;
	case '4':
	    DEBUGUARTPRINT
		("\r\n*** BTM222 - L4 = 57600bps detected! ***");
	    USART_SendData(USART1, 'a');
	    for (nCount = 0; nCount < nLength; nCount++) {
	    };			/* delay */
	    USART_SendData(USART1, 't');
	    for (nCount = 0; nCount < nLength; nCount++) {
	    };			/* delay */
	    USART_SendData(USART1, 'l');
	    for (nCount = 0; nCount < nLength; nCount++) {
	    };			/* delay */
	    USART_SendData(USART1, '5');
	    for (nCount = 0; nCount < nLength; nCount++) {
	    };			/* delay */
	    USART_SendData(USART1, '\r');
	    for (nCount = 0; nCount < nLength; nCount++) {
	    };			/* delay */
	    BTM222_UartAutobaudControl = 6;
	    break;
	case '5':
	    DEBUGUARTPRINT
		("\r\n*** BTM222 - L5 = 115200bps detected! ***");
	    BTM222_UartAutobaudControl = 9;
	    break;
	case '6':
	    DEBUGUARTPRINT
		("\r\n*** BTM222 - L6 = 230400bps detected! ***");
	    USART_SendData(USART1, 'a');
	    for (nCount = 0; nCount < nLength; nCount++) {
	    };			/* delay */
	    USART_SendData(USART1, 't');
	    for (nCount = 0; nCount < nLength; nCount++) {
	    };			/* delay */
	    USART_SendData(USART1, 'l');
	    for (nCount = 0; nCount < nLength; nCount++) {
	    };			/* delay */
	    USART_SendData(USART1, '5');
	    for (nCount = 0; nCount < nLength; nCount++) {
	    };			/* delay */
	    USART_SendData(USART1, '\r');
	    for (nCount = 0; nCount < nLength; nCount++) {
	    };			/* delay */
	    BTM222_UartAutobaudControl = 6;
	    break;
	case '7':
	    DEBUGUARTPRINT
		("\r\n*** BTM222 - L7 = 460800bps detected! ***");
	    USART_SendData(USART1, 'a');
	    for (nCount = 0; nCount < nLength; nCount++) {
	    };			/* delay */
	    USART_SendData(USART1, 't');
	    for (nCount = 0; nCount < nLength; nCount++) {
	    };			/* delay */
	    USART_SendData(USART1, 'l');
	    for (nCount = 0; nCount < nLength; nCount++) {
	    };			/* delay */
	    USART_SendData(USART1, '5');
	    for (nCount = 0; nCount < nLength; nCount++) {
	    };			/* delay */
	    USART_SendData(USART1, '\r');
	    for (nCount = 0; nCount < nLength; nCount++) {
	    };			/* delay */
	    BTM222_UartAutobaudControl = 6;
	    break;
	default:
	    DEBUGUARTPRINT("\r\n*** BTM222 - baudrate not detected! ***");
	    BTM222_UartAutobaudControl++;	/* increment AutobaudControl counter */
	    break;
	    }
	switch (BTM222_UartAutobaudControl)
	     {
	case 1:
	    
		/* Initialize USART1 with next possible baudrate of BTM222 */ 
		USART_InitStructure.USART_BaudRate = USART1_BAUDRATE_4800;
	    break;
	