stko/oobd/trunk/interface/D2/Firmware_FreeRTOS/Demo/CORTEX_STM32F103E_Eclipse_GCC/src/SystemConfig.c
case 2:
	    
		/* Initialize USART1 with next possible baudrate of BTM222 */ 
		USART_InitStructure.USART_BaudRate = USART1_BAUDRATE_9600;
	    break;
	case 3:
	    
		/* Initialize USART1 with next possible baudrate of BTM222 */ 
		USART_InitStructure.USART_BaudRate = USART1_BAUDRATE_19200;
	    break;
	case 4:
	    
		/* Initialize USART1 with next possible baudrate of BTM222 */ 
		USART_InitStructure.USART_BaudRate = USART1_BAUDRATE_38400;
	    break;
	case 5:
	    
		/* Initialize USART1 with next possible baudrate of BTM222 */ 
		USART_InitStructure.USART_BaudRate = USART1_BAUDRATE_57600;
	    break;
	case 6:
	    
		/* Initialize USART1 with next possible baudrate of BTM222 */ 
		USART_InitStructure.USART_BaudRate =
		USART1_BAUDRATE_115200;
	    break;
	case 7:
	    
		/* Initialize USART1 with next possible baudrate of BTM222 */ 
		USART_InitStructure.USART_BaudRate =
		USART1_BAUDRATE_230400;
	    break;
	case 8:
	    
		/* Initialize USART1 with next possible baudrate of BTM222 */ 
		USART_InitStructure.USART_BaudRate =
		USART1_BAUDRATE_460800;
	    break;
	case 9:
	    
		/* fallback to default baudrate */ 
		USART_InitStructure.USART_BaudRate =
		USART1_BAUDRATE_DEFAULT;
	    break;
	default:
	    break;
	    }
	USART_Init(USART1, &USART_InitStructure);	/* reinitialization of USART */
	}			/* end of for */
    DEBUGUARTPRINT("\r\n*** Autobaud SCAN for BTM222 finished! ***");
    DEBUGUARTPRINT("\r\n*** Starting to get BTM222 BT address! ***");
    
//  BTM222_BtAddress[18] = {'0','0',':','0','0',':','0','0',':','0','0',':','0','0',':','0','0','\0'};
	BTM222_UART_Rx_Flag = pdFALSE;
    BufCnt = 0;
    
	/* send "atb?"-command to get Bluetooth MAC address of BTM222 */ 
	USART_SendData(USART1, 'a');
    for (nCount = 0; nCount < nLength; nCount++) {
    };				/* delay */
    USART_SendData(USART1, 't');
    for (nCount = 0; nCount < nLength; nCount++) {
    };				/* delay */
    USART_SendData(USART1, 'b');
    for (nCount = 0; nCount < nLength; nCount++) {
    };				/* delay */
    USART_SendData(USART1, '?');
    for (nCount = 0; nCount < nLength; nCount++) {
    };				/* delay */
    USART_SendData(USART1, '\r');
    for (nCount = 0; nCount < nLength; nCount++) {
    };				/* delay */
    for (nCount = 0; nCount < 500000; nCount++) {
    };				/* delay */
    BTM222_UART_Rx_Flag = pdTRUE;
    DEBUGUARTPRINT("\r\n*** Get BTM222 BT address finished! ***");
    DEBUGUARTPRINT("\r\n*** Get BTM222 BT device name! ***");
    BTM222_UART_Rx_Flag = pdFALSE;
    BufCnt = 0;
    
	/* send "atn?"-command to get BTM222 device name */ 
	USART_SendData(USART1, 'a');
    for (nCount = 0; nCount < nLength; nCount++) {
    };				/* delay */
    USART_SendData(USART1, 't');
    for (nCount = 0; nCount < nLength; nCount++) {
    };				/* delay */
    USART_SendData(USART1, 'n');
    for (nCount = 0; nCount < nLength; nCount++) {
    };				/* delay */
    USART_SendData(USART1, '?');
    for (nCount = 0; nCount < nLength; nCount++) {
    };				/* delay */
    USART_SendData(USART1, '\r');
    for (nCount = 0; nCount < nLength; nCount++) {
    };				/* delay */
    for (nCount = 0; nCount < 500000; nCount++) {
    };				/* delay */
    BTM222_UART_Rx_Flag = pdTRUE;
    DEBUGUARTPRINT("\r\n*** Get BTM222 BT device name finished! ***");
    
	/* set "OOBD-Cup" as BTM222 Bluetooth device name if needed */ 
	if (BTM222_DeviceNameFlag == pdFALSE) {
	USART_SendData(USART1, 'a');
	for (nCount = 0; nCount < nLength; nCount++) {
	};			/* delay */
	USART_SendData(USART1, 't');
	for (nCount = 0; nCount < nLength; nCount++) {
	};			/* delay */
	USART_SendData(USART1, 'n');
	for (nCount = 0; nCount < nLength; nCount++) {
	};			/* delay */
	USART_SendData(USART1, '=');
	for (nCount = 0; nCount < nLength; nCount++) {
	};			/* delay */
	USART_SendData(USART1, 'O');
	for (nCount = 0; nCount < nLength; nCount++) {
	};			/* delay */
	USART_SendData(USART1, 'O');
	for (nCount = 0; nCount < nLength; nCount++) {
	};			/* delay */
	USART_SendData(USART1, 'B');
	for (nCount = 0; nCount < nLength; nCount++) {
	};			/* delay */
	USART_SendData(USART1, 'D');
	for (nCount = 0; nCount < nLength; nCount++) {
	};			/* delay */
	USART_SendData(USART1, '-');
	for (nCount = 0; nCount < nLength; nCount++) {
	};			/* delay */
	USART_SendData(USART1, 'C');
	for (nCount = 0; nCount < nLength; nCount++) {
	};			/* delay */
	USART_SendData(USART1, 'u');
	for (nCount = 0; nCount < nLength; nCount++) {
	};			/* delay */
	USART_SendData(USART1, 'p');
	for (nCount = 0; nCount < nLength; nCount++) {
	};			/* delay */
	USART_SendData(USART1, ' ');
	for (nCount = 0; nCount < nLength; nCount++) {
	};			/* delay */
	USART_SendData(USART1, BTM222_BtAddress[9]);
	for (nCount = 0; nCount < nLength; nCount++) {
	};			/* delay */
	USART_SendData(USART1, BTM222_BtAddress[10]);
	for (nCount = 0; nCount < nLength; nCount++) {
	};			/* delay */
	USART_SendData(USART1, BTM222_BtAddress[12]);
	for (nCount = 0; nCount < nLength; nCount++) {
	};			/* delay */
	USART_SendData(USART1, BTM222_BtAddress[13]);
	for (nCount = 0; nCount < nLength; nCount++) {
	};			/* delay */
	USART_SendData(USART1, BTM222_BtAddress[15]);
	for (nCount = 0; nCount < nLength; nCount++) {
	};			/* delay */
	USART_SendData(USART1, BTM222_BtAddress[16]);
	for (nCount = 0; nCount < nLength; nCount++) {
	};			/* delay */
	USART_SendData(USART1, '\r');
	for (nCount = 0; nCount < nLength; nCount++) {
	};			/* delay */
	for (nCount = 0; nCount < 500000; nCount++) {
	};			/* delay */
	DEBUGUARTPRINT
	    ("\r\n*** BTM222 device name set to 'OOBD-Cup' ***");
	BufCnt = 0;
	BTM222_UART_Rx_Flag = pdFALSE;
	
	    /* send "atn?"-command to get BTM222 device name */ 
	    USART_SendData(USART1, 'a');
	for (nCount = 0; nCount < nLength; nCount++) {
	};			/* delay */
	USART_SendData(USART1, 't');
	for (nCount = 0; nCount < nLength; nCount++) {
	};			/* delay */
	USART_SendData(USART1, 'n');
	for (nCount = 0; nCount < nLength; nCount++) {
	};			/* delay */
	USART_SendData(USART1, '?');
	for (nCount = 0; nCount < nLength; nCount++) {
	};			/* delay */
	USART_SendData(USART1, '\r');
	for (nCount = 0; nCount < nLength; nCount++) {
	};			/* delay */
	for (nCount = 0; nCount < 500000; nCount++) {
	};			/* delay */
	BTM222_UART_Rx_Flag = pdTRUE;
    