stko/oobd/trunk/interface/D2/Firmware_FreeRTOS/Demo/CORTEX_STM32F103E_Eclipse_GCC/src/SystemConfig.c
}
}


/*----------------------------------------------------------------------------*/ 
    
/**
  * @brief  Configures the different GPIO ports
  * @param  None
  * @retval None
  */ 
void USART2_Configuration(void) 
{
    USART_InitTypeDef USART_InitStructure;
    USART_DeInit(USART2);	/* Reset Uart to default */
    
  /** USARTx configuration -----------------------------------------------------
    * USARTx configured as follow:
    *      - BaudRate = 10400 baud
    *      - Word Length = 8 Bits
    *      - One Stop Bit
    *      - None parity
    *      - Hardware flow control disabled (RTS and CTS signals)
    *      - Receive and transmit enabled
    */ 
	USART_InitStructure.USART_BaudRate = 10400;
    USART_InitStructure.USART_WordLength = USART_WordLength_8b;
    USART_InitStructure.USART_StopBits = USART_StopBits_1;
    USART_InitStructure.USART_Parity = USART_Parity_No;
    USART_InitStructure.USART_HardwareFlowControl =
	USART_HardwareFlowControl_None;
    USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
    
	/* Configure USART2 */ 
	USART_Init(USART2, &USART_InitStructure);
    
	/* Enable the USART2 */ 
	USART_Cmd(USART2, ENABLE);
    
	/* Enable the USART2-Transmit interrupt: this interrupt is generated when the
	   USART1 transmit data register is empty */ 
	/* USART_ITConfig(USART2, USART_IT_TXE, ENABLE); */ 
	
	/* Enable the USART2-Receive interrupt: this interrupt is generated when the
	   USART2 receive data register is not empty */ 
	USART_ITConfig(USART2, USART_IT_RXNE, ENABLE);
    NVIC_Configuration();
} 

/**
  * @brief  Configures the different GPIO ports
  * @param  None
  * @retval None
  */ 
void CAN1_Configuration(uint8_t CAN_BusConfig, uint8_t CAN_ModeConfig) 
{
    DEBUGUARTPRINT("\r\n*** CANx_Configuration (CAN1) entered! ***");
    CAN_InitTypeDef CAN_InitStructure;
    CAN_FilterInitTypeDef CAN_FilterInitStructure;
    
	/* CAN register init */ 
	CAN_DeInit(CAN1);
    CAN_StructInit(&CAN_InitStructure);
    
	/* CAN cell init */ 
	CAN_InitStructure.CAN_TTCM = DISABLE;	/* Time triggered communication mode */
    CAN_InitStructure.CAN_ABOM = DISABLE;	/* Automatic bus-off management */
    CAN_InitStructure.CAN_AWUM = DISABLE;	/* Automatic wakeup mode */
    CAN_InitStructure.CAN_NART = DISABLE;	/* No automatic retransmission */
    CAN_InitStructure.CAN_RFLM = DISABLE;	/* Receive FIFO locked mode */
    CAN_InitStructure.CAN_TXFP = ENABLE;	/* Transmit FIFO priority */
    
	/* CAN_Mode_Normal, CAN_Mode_LoopBack, CAN_Mode_Silent, CAN_Mode_Silent_LoopBack */ 
//  CAN_InitStructure.CAN_Mode = CAN_Mode_Normal;
	CAN_InitStructure.CAN_Mode = CAN_ModeConfig;
    CAN_InitStructure.CAN_SJW = CAN_SJW_1tq;
    if (CAN_BusConfig == VALUE_BUS_CONFIG_11bit_125kbit
	  || CAN_BusConfig == VALUE_BUS_CONFIG_29bit_125kbit)
	 {
	CAN_InitStructure.CAN_BS1 = CAN_BS1_3tq;
	CAN_InitStructure.CAN_BS2 = CAN_BS2_5tq;
	CAN_InitStructure.CAN_Prescaler = 32;	/* BRP Baudrate prescaler */
	}
    
    else if (CAN_BusConfig == VALUE_BUS_CONFIG_11bit_250kbit
	     || CAN_BusConfig == VALUE_BUS_CONFIG_29bit_250kbit)
	 {
	CAN_InitStructure.CAN_BS1 = CAN_BS1_3tq;
	CAN_InitStructure.CAN_BS2 = CAN_BS2_5tq;
	CAN_InitStructure.CAN_Prescaler = 16;	/* BRP Baudrate prescaler */
	}
    
    else if (CAN_BusConfig == VALUE_BUS_CONFIG_11bit_500kbit
	     || CAN_BusConfig == VALUE_BUS_CONFIG_29bit_500kbit)
	 {
	CAN_InitStructure.CAN_BS1 = CAN_BS1_3tq;
	CAN_InitStructure.CAN_BS2 = CAN_BS2_5tq;
	CAN_InitStructure.CAN_Prescaler = 8;	/* BRP Baudrate prescaler */
	}
    
    else if (CAN_BusConfig == VALUE_BUS_CONFIG_11bit_1000kbit
	     || CAN_BusConfig == VALUE_BUS_CONFIG_29bit_1000kbit)
	 {
	CAN_InitStructure.CAN_BS1 = CAN_BS1_3tq;
	CAN_InitStructure.CAN_BS2 = CAN_BS2_5tq;
	CAN_InitStructure.CAN_Prescaler = 4;	/* BRP Baudrate prescaler */
	}
    
    else
	 {
	
	    /* default CAN bus speed is set to 500kbaud */ 
	    CAN_InitStructure.CAN_BS1 = CAN_BS1_3tq;
	CAN_InitStructure.CAN_BS2 = CAN_BS2_5tq;
	CAN_InitStructure.CAN_Prescaler = 8;	/* BRP Baudrate prescaler */
	}
    CAN_Init(CAN1, &CAN_InitStructure);
    
	//! \todo Filter must be configurable via parameter to use also 29bit CAN-ID
	/* CAN filter init */ 
	CAN_FilterInitStructure.CAN_FilterNumber = 0;
    CAN_FilterInitStructure.CAN_FilterMode = CAN_FilterMode_IdMask;
    CAN_FilterInitStructure.CAN_FilterScale = CAN_FilterScale_32bit;
    CAN_FilterInitStructure.CAN_FilterIdHigh = 0x0700 << 5;	/* CAN-ID 0x700 */
    CAN_FilterInitStructure.CAN_FilterIdLow = 0x0000;
    CAN_FilterInitStructure.CAN_FilterMaskIdHigh = 0x0700 << 5;	/* Range 0x700-0x7FF) */
    CAN_FilterInitStructure.CAN_FilterMaskIdLow = 0x0000;
    CAN_FilterInitStructure.CAN_FilterFIFOAssignment = 0;
    CAN_FilterInitStructure.CAN_FilterActivation = ENABLE;
    CAN_FilterInit(&CAN_FilterInitStructure);
    CAN_ITConfig(CAN1, CAN_IT_FMP0, ENABLE);
    DEBUGUARTPRINT("\r\n*** CANx_Configuration (CAN1) finished***");
}


/*----------------------------------------------------------------------------*/ 
void ADC_Configuration(void) 
{
    ADC_InitTypeDef ADC_InitStructure;
    
	/* PCLK2 is the APB2 clock */ 
	/* ADCCLK = PCLK2/6 = 72/6 = 12MHz */ 
	RCC_ADCCLKConfig(RCC_PCLK2_Div6);
    
	/* Enable ADC1 clock so that we can talk to it */ 
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE);
    
	/* Put everything back to power-on defaults */ 
	ADC_DeInit(ADC1);
    
	/* ADC1 Configuration ------------------------------------------------------ */ 
	/* ADC1 and ADC2 operate independently */ 
	ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
    
	/* Disable the scan conversion so we do one at a time */ 
	ADC_InitStructure.ADC_ScanConvMode = DISABLE;
    
	/* Don't do continuous conversions - do them on demand */ 
	ADC_InitStructure.ADC_ContinuousConvMode = DISABLE;
    
	/* Start conversion by software, not on external trigger */ 
	ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
    
	/* Conversions are 12 bit - put them in the lower 12 bits of the result */ 
	ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
    
	/* Say how many channels would be used by the sequencer */ 
	ADC_InitStructure.ADC_NbrOfChannel = 1;	/* Now do the setup */
    ADC_Init(ADC1, &ADC_InitStructure);	/* Enable ADC1 */
    